Revit 2027 API
ParameterTypeId.SheetDesignedBy Property
 "Designed By"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetDesignedBy { get; }
Public Shared ReadOnly Property SheetDesignedBy As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetDesignedBy {
	ForgeTypeId^ get ();
}
static member SheetDesignedBy : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace